{
  "title": "Understanding the Passive Voice",
  "description": "This document provides tips and explanations to help you identify and understand the passive voice in English grammar.",
  "tips": [
    {
      "title": "What is the Passive Voice?",
      "description": "The passive voice is a grammatical construction where the subject of a sentence receives the action of the verb, rather than performing it. The emphasis is on the action and what is acted upon, not on the doer of the action.",
      "examples": [
        "The ball was thrown by the boy. (Passive)",
        "The report was written yesterday. (Passive)",
        "Mistakes were made. (Passive)"
      ]
    },
    {
      "title": "How is the Passive Voice Formed?",
      "description": "The passive voice is typically formed using a form of the verb 'to be' (is, am, are, was, were, be, being, been) followed by the past participle of the main verb. The doer of the action, if mentioned, is usually introduced by the preposition 'by'.",
      "examples": [
        "is built",
        "was eaten",
        "has been repaired",
        "will be completed",
        "might be considered"
      ]
    },
    {
      "title": "Identifying the Agent (Doer of the Action)",
      "description": "In passive voice sentences, the agent (the person or thing performing the action) is often omitted or placed at the end of the sentence in a 'by' phrase. If the agent is unknown, unimportant, or obvious, it's often left out.",
      "examples": [
        "The cake was eaten. (Agent omitted)",
        "The car was repaired by the mechanic. (Agent specified)",
        "The decision will be announced soon. (Agent omitted)"
      ]
    },
    {
      "title": "When to Use the Passive Voice",
      "description": "The passive voice is often used in specific contexts, such as: when the doer of the action is unknown or unimportant; when you want to emphasize the action or the recipient of the action; in scientific or technical writing to maintain objectivity; and when avoiding assigning blame.",
      "examples": [
        "The ancient ruins were discovered in 1820. (Doer unknown)",
        "Customer complaints are handled promptly. (Emphasis on complaints)",
        "The experiment was conducted under sterile conditions. (Scientific writing)",
        "The window was broken. (Avoiding blame)"
      ]
    },
    {
      "title": "Passive Voice vs. Active Voice",
      "description": "Understanding the difference between passive and active voice is crucial. In active voice, the subject performs the action. Active voice is generally preferred for clarity, directness, and conciseness, while passive voice can sometimes make sentences less direct or seem evasive.",
      "examples": [
        "The boy threw the ball. (Active)",
        "The ball was thrown by the boy. (Passive)",
        "The company announced the new policy. (Active)",
        "The new policy was announced by the company. (Passive)"
      ]
    }
  ]
}